Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/atdf/PIC32CZ8110CA90144.atdf
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="TCC0_" caption="TCC0" mask="0x2"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x4"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x8"/>
          <bitfield name="TCC3_" caption="TCC3" mask="0x10"/>
          <bitfield name="TCC4_" caption="TCC4" mask="0x20"/>
          <bitfield name="TCC5_" caption="TCC5" mask="0x40"/>
          <bitfield name="TCC6_" caption="TCC6" mask="0x80"/>
          <bitfield name="TCC7_" caption="TCC7" mask="0x100"/>
          <bitfield name="TCC8_" caption="TCC8" mask="0x200"/>
          <bitfield name="TCC9_" caption="TCC9" mask="0x400"/>
          <bitfield name="ADC_" caption="ADC" mask="0x800"/>
          <bitfield name="AC_" caption="AC" mask="0x1000"/>
          <bitfield name="PTC_" caption="PTC" mask="0x2000"/>
          <bitfield name="SPI_IXS0_" caption="SPI_IXS0" mask="0x4000"/>
          <bitfield name="CAN0_" caption="CAN0" mask="0x10000"/>
          <bitfield name="CAN1_" caption="CAN1" mask="0x20000"/>
          <bitfield name="CAN2_" caption="CAN2" mask="0x40000"/>
          <bitfield name="CAN3_" caption="CAN3" mask="0x80000"/>
          <bitfield name="ETH_" caption="ETH" mask="0x1000000"/>
          <bitfield name="TRNG_" caption="TRNG" mask="0x8000000"/>
          <bitfield name="SDMMC0_" caption="SDMMC0" mask="0x10000000"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="MLB_" caption="MLB" mask="0x4"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x1"/>
          <bitfield name="FCW_" caption="FCW APB Protect Enable" mask="0x2"/>
          <bitfield name="FCR_" caption="FCR APB Protect Enable" mask="0x4"/>
          <bitfield name="PM_" caption="PM APB Protect Enable" mask="0x8"/>
          <bitfield name="SUPC_" caption="SUPC APB Protect Enable" mask="0x10"/>
          <bitfield name="RSTC_" caption="RSTC APB Protect Enable" mask="0x20"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Protect Enable" mask="0x40"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Protect Enable" mask="0x80"/>
          <bitfield name="GCLK_" caption="GCLK APB Protect Enable" mask="0x100"/>
          <bitfield name="MCLK_" caption="MCLK APB Protect Enable" mask="0x200"/>
          <bitfield name="FREQM_" caption="FREQM APB Protect Enable" mask="0x400"/>
          <bitfield name="WDT_" caption="WDT APB Protect Enable" mask="0x800"/>
          <bitfield name="RTC_" caption="RTC APB Protect Enable" mask="0x1000"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x2000"/>
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x4000"/>
          <bitfield name="DRMTCM_" caption="DRMTCM APB Protect Enable" mask="0x8000"/>
          <bitfield name="MCRAMC_" caption="MCRAMC APB Protect Enable" mask="0x10000"/>
          <bitfield name="TRAM_" caption="TRAM APB Protect Enable" mask="0x20000"/>
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x40000"/>
          <bitfield name="DMA_" caption="DMA APB Protect Enable" mask="0x80000"/>
          <bitfield name="PRM_" caption="PRM APB Protect Enable" mask="0x200000"/>
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x400000"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x800000"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x1000000"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x2000000"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x4000000"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Protect Enable" mask="0x8000000"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Protect Enable" mask="0x10000000"/>
        </register>
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge B">
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x2"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x4"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x8"/>
          <bitfield name="TCC3_" caption="TCC3 APB Protect Enable" mask="0x10"/>
          <bitfield name="TCC4_" caption="TCC4 APB Protect Enable" mask="0x20"/>
          <bitfield name="TCC5_" caption="TCC5 APB Protect Enable" mask="0x40"/>
          <bitfield name="TCC6_" caption="TCC6 APB Protect Enable" mask="0x80"/>
          <bitfield name="TCC7_" caption="TCC7 APB Protect Enable" mask="0x100"/>
          <bitfield name="TCC8_" caption="TCC8 APB Protect Enable" mask="0x200"/>
          <bitfield name="TCC9_" caption="TCC9 APB Protect Enable" mask="0x400"/>
          <bitfield name="ADC_" caption="ADC APB Protect Enable" mask="0x800"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x1000"/>
          <bitfield name="PTC_" caption="PTC APB Protect Enable" mask="0x2000"/>
          <bitfield name="SPI_IXS0_" caption="SPI_IXS0 APB Protect Enable" mask="0x4000"/>
          <bitfield name="CAN0_" caption="CAN0 APB Protect Enable" mask="0x10000"/>
          <bitfield name="CAN1_" caption="CAN1 APB Protect Enable" mask="0x20000"/>
          <bitfield name="CAN2_" caption="CAN2 APB Protect Enable" mask="0x40000"/>
          <bitfield name="CAN3_" caption="CAN3 APB Protect Enable" mask="0x80000"/>
          <bitfield name="ETH_" caption="ETH APB Protect Enable" mask="0x1000000"/>
          <bitfield name="SQI0_" caption="SQI0 APB Protect Enable" mask="0x2000000"/>
          <bitfield name="TRNG_" caption="TRNG APB Protect Enable" mask="0x8000000"/>
          <bitfield name="SDMMC0_" caption="SDMMC0 APB Protect Enable" mask="0x10000000"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000038" caption="Peripheral write protection status - Bridge C">
          <bitfield name="MLB_" caption="MLB APB Protect Enable" mask="0x4"/>
        </register>
      </register-group>
      <value-group name="WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
