Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/atdf/PIC32CZ8110CA90144.atdf
        <register name="TAMPCTRL" offset="0x60" rw="RW" size="4" initval="0x00000000" caption="Tamper Control">
          <bitfield name="IN0ACT" caption="Tamper Input 0 Action" mask="0x3" values="RTC_TAMPCTRL__IN0ACT"/>
          <bitfield name="IN1ACT" caption="Tamper Input 1 Action" mask="0xC" values="RTC_TAMPCTRL__IN1ACT"/>
          <bitfield name="IN2ACT" caption="Tamper Input 2 Action" mask="0x30" values="RTC_TAMPCTRL__IN2ACT"/>
          <bitfield name="IN3ACT" caption="Tamper Input 3 Action" mask="0xC0" values="RTC_TAMPCTRL__IN3ACT"/>
          <bitfield name="IN4ACT" caption="Tamper Input 4 Action" mask="0x300" values="RTC_TAMPCTRL__IN4ACT"/>
          <bitfield name="IN5ACT" caption="Tamper Input 5 Action" mask="0xC00" values="RTC_TAMPCTRL__IN5ACT"/>
          <bitfield name="IN6ACT" caption="Tamper Input 6 Action" mask="0x3000" values="RTC_TAMPCTRL__IN6ACT"/>
          <bitfield name="IN7ACT" caption="Tamper Input 7 Action" mask="0xC000" values="RTC_TAMPCTRL__IN7ACT"/>
          <bitfield name="TAMLVL0" caption="Tamper Level Select 0" mask="0x10000"/>
          <bitfield name="TAMLVL1" caption="Tamper Level Select 1" mask="0x20000"/>
          <bitfield name="TAMLVL2" caption="Tamper Level Select 2" mask="0x40000"/>
          <bitfield name="TAMLVL3" caption="Tamper Level Select 3" mask="0x80000"/>
          <bitfield name="TAMLVL4" caption="Tamper Level Select 4" mask="0x100000"/>
          <bitfield name="TAMLVL5" caption="Tamper Level Select 5" mask="0x200000"/>
          <bitfield name="TAMLVL6" caption="Tamper Level Select 6" mask="0x400000"/>
          <bitfield name="TAMLVL7" caption="Tamper Level Select 7" mask="0x800000"/>
          <bitfield name="DEBNC0" caption="Debouncer Enable 0" mask="0x1000000"/>
          <bitfield name="DEBNC1" caption="Debouncer Enable 1" mask="0x2000000"/>
          <bitfield name="DEBNC2" caption="Debouncer Enable 2" mask="0x4000000"/>
          <bitfield name="DEBNC3" caption="Debouncer Enable 3" mask="0x8000000"/>
          <bitfield name="DEBNC4" caption="Debouncer Enable 4" mask="0x10000000"/>
          <bitfield name="DEBNC5" caption="Debouncer Enable 5" mask="0x20000000"/>
          <bitfield name="DEBNC6" caption="Debouncer Enable 6" mask="0x40000000"/>
          <bitfield name="DEBNC7" caption="Debouncer Enable 7" mask="0x80000000"/>
        </register>
        <register modes="MODE0" name="TIMESTAMP" offset="0x64" rw="R" access="RSYNC" size="4" initval="0x00000000" caption="MODE0 Timestamp">
          <bitfield name="COUNT" caption="Count Timestamp Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="MODE1" name="TIMESTAMP" offset="0x64" rw="R" access="RSYNC" size="4" initval="0x00000000" caption="MODE1 Timestamp">
          <bitfield name="COUNT" caption="Count Timestamp Value" mask="0xFFFF"/>
        </register>
        <register modes="MODE2" name="TIMESTAMP" offset="0x64" rw="R" access="RSYNC" size="4" initval="0x00000000" caption="MODE2 Timestamp">
          <bitfield name="SECOND" caption="Second Timestamp Value" mask="0x3F"/>
          <bitfield name="MINUTE" caption="Minute Timestamp Value" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour Timestamp Value" mask="0x1F000"/>
          <bitfield name="DAY" caption="Day Timestamp Value" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month Timestamp Value" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year Timestamp Value" mask="0xFC000000"/>
        </register>
        <register name="TAMPID" offset="0x68" rw="RW" size="4" atomic-op="clear:TAMPID" initval="0x00000000" caption="Tamper ID">
          <bitfield name="TAMPID0" caption="Tamper Input 0 Detected" mask="0x1"/>
          <bitfield name="TAMPID1" caption="Tamper Input 1 Detected" mask="0x2"/>
          <bitfield name="TAMPID2" caption="Tamper Input 2 Detected" mask="0x4"/>
          <bitfield name="TAMPID3" caption="Tamper Input 3 Detected" mask="0x8"/>
          <bitfield name="TAMPID4" caption="Tamper Input 4 Detected" mask="0x10"/>
          <bitfield name="TAMPID5" caption="Tamper Input 5 Detected" mask="0x20"/>
          <bitfield name="TAMPID6" caption="Tamper Input 6 Detected" mask="0x40"/>
          <bitfield name="TAMPID7" caption="Tamper Input 7 Detected" mask="0x80"/>
          <bitfield name="TAMPEVT" caption="Tamper Event Detected" mask="0x80000000"/>
        </register>
        <register name="TAMPCTRLB" offset="0x6C" rw="RW" size="4" initval="0x00000000" caption="Tamper Control B">
          <bitfield name="ALSI0" caption="Active Layer Select Internal 0" mask="0x1"/>
          <bitfield name="ALSI1" caption="Active Layer Select Internal 1" mask="0x2"/>
          <bitfield name="ALSI2" caption="Active Layer Select Internal 2" mask="0x4"/>
          <bitfield name="ALSI3" caption="Active Layer Select Internal 3" mask="0x8"/>
          <bitfield name="ALSI4" caption="Active Layer Select Internal 4" mask="0x10"/>
          <bitfield name="ALSI5" caption="Active Layer Select Internal 5" mask="0x20"/>
          <bitfield name="ALSI6" caption="Active Layer Select Internal 6" mask="0x40"/>
          <bitfield name="ALSI7" caption="Active Layer Select Internal 7" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="MODE2_ALARM__HOUR">
        <value name="AM" caption="Morning hour" value="0x00"/>
        <value name="PM" caption="Afternoon hour" value="0x10"/>
      </value-group>
      <value-group name="MODE2_MASK__SEL">
        <value name="OFF" caption="Alarm Disabled" value="0x0"/>
        <value name="SS" caption="Match seconds only" value="0x1"/>
        <value name="MMSS" caption="Match seconds and minutes only" value="0x2"/>
        <value name="HHMMSS" caption="Match seconds, minutes, and hours only" value="0x3"/>
        <value name="DDHHMMSS" caption="Match seconds, minutes, hours, and days only" value="0x4"/>
        <value name="MMDDHHMMSS" caption="Match seconds, minutes, hours, days, and months only" value="0x5"/>
        <value name="YYMMDDHHMMSS" caption="Match seconds, minutes, hours, days, months, and years" value="0x6"/>
      </value-group>
      <value-group name="MODE0_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0x0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="0x1"/>
        <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="0x2"/>
      </value-group>
      <value-group name="RTC_MODE0_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="MODE1_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="1"/>
        <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="2"/>
      </value-group>
      <value-group name="RTC_MODE1_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
