Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/atdf/PIC32CZ8110CA90144.atdf
        <register name="BDCON" offset="0x134" rw="RW" size="4" initval="0x00000000" caption="BD_CTRL Register">
          <bitfield name="DMAEN" caption="DMA Enable Bit 1 - Enabled, 0 - Disabled" mask="0x1"/>
          <bitfield name="POLLEN" caption="Setting this bit would cause Buffer Descriptor processor (BDP) to poll for descriptor valid till descriptor valid bit is set or till poll counter expires based on value programmed in BD_POLL_CTRL register." mask="0x2"/>
          <bitfield name="START" caption="Setting this bit to '1' would start BDP (Buffer Descriptor Processor) to fetch a  descriptor and hence this bit should be enabled only after all the DMA descriptor programming is done. Hardware clears this bit automatically after one clock cycle." mask="0x4"/>
        </register>
        <register name="BDCURADD" offset="0x138" rw="R" size="4" initval="0x00000000" caption="BD_CURR_ADDR Register">
          <bitfield name="BDCURRADDR" caption="This register field contains the current descriptor address being processed by Buffer Descriptor Processor (BDP)" mask="0xFFFFFFFF"/>
        </register>
        <register name="BDBASEADD" offset="0x140" rw="RW" size="4" initval="0x00000000" caption="BD_BASE_ADDR register">
          <bitfield name="BDADDR" caption="This register field contains the base address of the DMA. This register must be updated only when the DMA is IDLE." mask="0xFFFFFFFF"/>
        </register>
        <register name="BDSTAT" offset="0x144" rw="R" size="4" caption="BD_STATUS Register">
          <bitfield name="BDCON" caption="This register field contains the current Descriptor control information. Bits [31:16] of BD_CTRL field of current descriptor are indicated in this register field." mask="0xFFFF"/>
          <bitfield name="DMAACTV" caption="A value of '1' would indicate that Buffer Descriptor Processor (BDP) is not Idle. Value of '0' would indicate that BDP is in IDLE state" mask="0x10000"/>
          <bitfield name="DMASTART" caption="This register field would indicate whether DMA has started or not, if bit it set '1', then it indicates DMA start has happened. Value of '0' would indicate that DMA hasn't started." mask="0x20000"/>
          <bitfield name="BDSTATE" caption="This register field contains current BDP state :  0  IDLE, 1  Descriptor fetch Request Pending, 2  BD loading, 3  Data phase , 4  Descriptor Done, 5  Fetched BD is disabled, 6  Wait for Control Buffer Available, 7  Wait for AHB Error Acknowledgement" mask="0x3C0000"/>
        </register>
        <register name="BDPOLLCON" offset="0x148" rw="RW" size="4" caption="BD_POLL_CTRL Register">
          <bitfield name="POLLCON" caption="Number of cycles that BDP block would wait before re-fetching the Descriptor control word if the previous descriptor fetched was disabled" mask="0xFFFF"/>
        </register>
        <register name="BDTXDSTAT" offset="0x14C" rw="RW" size="4" caption="BD_TX_DMA_STATUS Register">
          <bitfield name="TXCURBUFLEN" caption="This register field gives the length of the current buffer transmit length" mask="0xFFFF"/>
          <bitfield name="TXBUFCNT" caption="This register field gives the information about the internal transmit FIFO space." mask="0xFF0000"/>
        </register>
        <register name="BDRXDSTAT" offset="0x150" rw="R" size="4" caption="BD_RX_DMA_STATUS Register">
          <bitfield name="RXCURBUFLEN" caption="This register field gives the length of the current buffer receive length" mask="0xFFFF"/>
          <bitfield name="RXBUFCNT" caption="This register field gives the information about the internal receive FIFO space." mask="0x10000"/>
        </register>
        <register name="THR" offset="0x154" rw="RW" size="4" initval="0x00000000" caption="SPI Control threshold register">
          <bitfield name="THRES" caption="SPI Control Threshold Value. SPI Control Threshold Interrupt is asserted, whenever larger than SPI Control Threshold amount of space available in SPI Control Buffer." mask="0x7"/>
        </register>
        <register name="INTSIGEN" offset="0x158" rw="RW" size="4" initval="0x000008AD" caption="SPI Interrupt Signal Enable Register">
          <bitfield name="TXEMPTYISE" caption="TX FIFO Empty Interrupt Signal Enable." mask="0x1"/>
          <bitfield name="TXFULLISE" caption="TX FIFO Full Interrupt Signal Enable." mask="0x2"/>
          <bitfield name="TXTHRISE" caption="Signal Enable Interrupt to be generated when the TX FIFO has space equal to or more than TX_INT_THRES words." mask="0x4"/>
          <bitfield name="RXEMPTYISE" caption="RX FIFO Empty Interrupt Signal Enable." mask="0x8"/>
          <bitfield name="RXFULLISE" caption="RX FIFO Full Interrupt Signal Enable." mask="0x10"/>
          <bitfield name="RXTHRISE" caption="Signal Enable Interrupt to be generated when the RX FIFO has data more than or equal to RX_INT_THRES words.  In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power on reset, till a read request on the AHB Bus." mask="0x20"/>
          <bitfield name="CONFULLISE" caption="Control Buffer Full Interrupt Signal Enable" mask="0x40"/>
          <bitfield name="CONEMPTYISE" caption="Control Buffer Empty Interrupt Signal Enable" mask="0x80"/>
          <bitfield name="CONTHRISE" caption="Control Buffer Threshold Interrupt Signal Enable" mask="0x100"/>
          <bitfield name="BDDONEISE" caption="Current Buffer Descriptor Interrupt Signal Enable" mask="0x200"/>
          <bitfield name="PKTCOMPISE" caption="Packet completion Interrupt Signal Enable" mask="0x400"/>
          <bitfield name="DMAEISE" caption="Master Error Interrupt Signal Enable" mask="0x800"/>
        </register>
        <register name="TAPCON" offset="0x15C" rw="RW" size="4" initval="0x00110021" caption="Tap Control Register">
          <bitfield name="CLKOUTDLY" caption="Used to add delay on spi clock output.16 taps available." mask="0xF"/>
          <bitfield name="DATAOUTDLY" caption="Used to add delay on spi data outputs (1/2/4lanes). 16 taps available." mask="0xF0"/>
          <bitfield name="SDRCLKINDLY" caption="Used only in SDR mode. This field is used to add tap delay cells on the spi clock input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values  (CLK_IN_DLY_CNT Vs CLK_IN_ALT_DLY_CNT)." mask="0x3F00"/>
          <bitfield name="DDRDATINDLY" caption="Used only in DDR mode. This field is used to add tap delay cells on the data input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values (DATA_IN_ALT_DLY_CNT Vs DATA_IN_DLY_CNT)." mask="0xF0000"/>
          <bitfield name="SDRDATINDLY" caption="Used only in SDR mode. This field is used to add tap delay cells on the Data input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values (DATA_IN_ALT_DLY_CNT Vs DATA_IN_DLY_CNT)." mask="0xF00000"/>
          <bitfield name="DDRCLKINDLY" caption="Used only in DDR mode. This field is used to add tap delay cells on the spi clock input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values (CLK_IN_DLY_CNT Vs CLK_IN_ALT_DLY_CNT)." mask="0x3F000000"/>
        </register>
        <register name="MEMSTAT" offset="0x160" rw="RW" size="4" initval="0x00010005" caption="SPI Status Control Register">
          <bitfield name="STATCMD" caption="Status Data: The first byte to be sent must be in LSB. For example if the user wants to send 0F first and 0C second, then we should program 16?h0C0F." mask="0xFFFF"/>
          <bitfield name="STATBYTES" caption="No. of bytes to send: 00 - Reserved ,01 - 1 byte ,10 - 2 bytes ,11 - Reserved" mask="0x30000"/>
          <bitfield name="TYPESTAT" caption="Status Lane: Indicates the number of lanes (single/dual/quad) in which the Status command/ Read Status Register value is transmitted to /received from flash. 2?b00 - single lane, 2?b01 - dual lane, 2?b10 - quad lane" mask="0xC0000"/>
          <bitfield name="STATPOS" caption="Indicates whether the BUSY bit position in Status Register of flash is 0 or 7. 1?b0 - 0th bit position (bit 0 is valid for busy status), 1?b1 - 7th bit position (bit7 is valid for busy status) The Controller continuously reads the Status register value from flash until this bit which indicates the flash busy status goes low." mask="0x100000"/>
        </register>
        <register name="XCON3" offset="0x164" rw="RW" size="4" initval="0x00000000" caption="SPI XIP Control 3 Register">
          <bitfield name="INIT1CMD1" caption="8bit SPI Init1 Code1 value." mask="0xFF"/>
          <bitfield name="INIT1CMD2" caption="8bit SPI Init1 Code2 value." mask="0xFF00"/>
          <bitfield name="INIT1CMD3" caption="8bit SPI Init1 Code3 value." mask="0xFF0000"/>
          <bitfield name="INIT1TYPE" caption="SPI TYPE  INIT1: 00 - Single lane mode , 01 - Dual lane mode , 10 - Quad lane mode , 11 - Reserved for Future use. Based on this field, the boot controller will send the INIT1 Code in 1/2/4 lane." mask="0x3000000"/>
          <bitfield name="INIT1COUNT" caption="2bit SPI INIT1 Count. Indicates whether 1, 2 or 3 bytes of INIT1 Code value are being sent." mask="0xC000000"/>
          <bitfield name="INIT1SCHECK" caption="SPI Init1 Status Check: 0 - do not check status, 1 - check status. If this bit is set to 1, the hardware will issue the status command automatically after the current operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: The Status Command will be formed according to the settings in the SPI Status Control Reg (@0x60)" mask="0x10000000"/>
        </register>
        <register name="XCON4" offset="0x168" rw="RW" size="4" initval="0x00000000" caption="SPI XIP Control4 Register">
          <bitfield name="INIT2CMD1" caption="8bit SPI Init2 Code1 value." mask="0xFF"/>
          <bitfield name="INIT2CMD2" caption="8bit SPI Init2 Code2 value" mask="0xFF00"/>
          <bitfield name="INIT2CMD3" caption="8bit SPI Init2 Code3 value" mask="0xFF0000"/>
          <bitfield name="INIT2TYPE" caption="SPI TYPE INIT2:  00 - Single lane mode. 01 - Dual lane mode. 10 - Quad lane mode. 11 - Reserved for Future use. Based on this field, the boot controller will send the INIT2 Code in 1/2/4 lane." mask="0x3000000"/>
          <bitfield name="INIT2COUNT" caption="2bit SPI INIT2 Count. Indicates whether 1, 2 or 3 bytes of INIT2 Code value are being sent." mask="0xC000000"/>
          <bitfield name="INIT2SCHECK" caption="SPI Init2 Status Check: 0 - do not check status 1 - check status If this bit is set to 1, the hardware will issue the status command automatically after thecurrent operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: The Status Command will be formed according to the settings in the SPI Status  Control Reg (@0x60)" mask="0x10000000"/>
        </register>
      </register-group>
      <register-group name="SQI_DESCRIPTOR" caption="Polaris Serial Quad Interface SIB" section="flexram" aligned="4">
        <register name="BDCTRL" offset="0x0" rw="RW" size="4" caption="Buffer Descriptor Control Register">
          <bitfield name="BD_BUFLEN" caption="Buffer Descriptor Length" mask="0x1FF"/>
          <bitfield name="CBD_INT_EN" caption="Generate Interrupt after processing the current buffer descriptor" mask="0x10000"/>
          <bitfield name="PKT_INT_EN" caption="Generate Interrupt after processing the current buffer descriptor, if it is the end of the packet." mask="0x20000"/>
          <bitfield name="LIFM" caption="Indicates last data of the packet." mask="0x40000"/>
          <bitfield name="LAST_BD" caption="Last Buffer Descriptors." mask="0x80000"/>
          <bitfield name="DIR" caption="Direction of data transfer." mask="0x100000"/>
          <bitfield name="SDR_DDR" caption="SDR or DDR mode" mask="0x200000"/>
          <bitfield name="MODE" caption="Based on the mode, the controller has to transmit or receive the data in one or two or 4 lanes" mask="0xC00000"/>
          <bitfield name="SPI_DEV_SEL2" caption="SPI Device Select bit 2" mask="0x1000000"/>
          <bitfield name="LSBF" caption="Data format on SPI Data Lanes" mask="0x2000000"/>
          <bitfield name="STAT_CHECK" caption="Status Check" mask="0x8000000"/>
          <bitfield name="SPI_DEV_SEL10" caption="SPI Device Select bits 1:0" mask="0x30000000"/>
          <bitfield name="CS_ASSERT" caption="Chip Select Assert/Deassert" mask="0x40000000"/>
          <bitfield name="DESC_EN" caption="Descriptor Enable" mask="0x80000000"/>
        </register>
        <register name="BDSTATUS" offset="0x4" rw="RW" size="4" caption="Buffer Descriptor Status Register">
        </register>
        <register name="BDADDR" offset="0x8" rw="RW" size="4" caption="Buffer Descriptor Address Register">
        </register>
        <register name="BDNXTPTR" offset="0xC" rw="RW" size="4" caption="Buffer Descriptor Next Pointer Register">
        </register>
      </register-group>
